docs/phase-5-results/stress.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: k6/scenarios/stress-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 300 max VUs, 6m0s max duration (incl. graceful stop):
              * stress: Up to 300 looping VUs for 5m30s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 001/300 VUs, 1 complete and 0 interrupted iterations
stress   [   0% ] 001/300 VUs  0m01.0s/5m30.0s

running (0m02.0s), 003/300 VUs, 6 complete and 0 interrupted iterations
stress   [   1% ] 003/300 VUs  0m02.0s/5m30.0s

running (0m03.0s), 004/300 VUs, 16 complete and 0 interrupted iterations
stress   [   1% ] 004/300 VUs  0m03.0s/5m30.0s

running (0m04.0s), 006/300 VUs, 33 complete and 0 interrupted iterations
stress   [   1% ] 006/300 VUs  0m04.0s/5m30.0s

running (0m05.0s), 008/300 VUs, 55 complete and 0 interrupted iterations
stress   [   2% ] 008/300 VUs  0m05.0s/5m30.0s

running (0m06.0s), 009/300 VUs, 81 complete and 0 interrupted iterations
stress   [   2% ] 009/300 VUs  0m06.0s/5m30.0s

running (0m07.0s), 011/300 VUs, 114 complete and 0 interrupted iterations
stress   [   2% ] 011/300 VUs  0m07.0s/5m30.0s

running (0m08.0s), 013/300 VUs, 152 complete and 0 interrupted iterations
stress   [   2% ] 013/300 VUs  0m08.0s/5m30.0s

running (0m09.0s), 014/300 VUs, 193 complete and 0 interrupted iterations
stress   [   3% ] 014/300 VUs  0m09.0s/5m30.0s

running (0m10.0s), 016/300 VUs, 243 complete and 0 interrupted iterations
stress   [   3% ] 016/300 VUs  0m10.0s/5m30.0s

running (0m11.0s), 018/300 VUs, 296 complete and 0 interrupted iterations
stress   [   3% ] 018/300 VUs  0m11.0s/5m30.0s

running (0m12.0s), 019/300 VUs, 356 complete and 0 interrupted iterations
stress   [   4% ] 019/300 VUs  0m12.0s/5m30.0s

running (0m13.0s), 021/300 VUs, 420 complete and 0 interrupted iterations
stress   [   4% ] 021/300 VUs  0m13.0s/5m30.0s

running (0m14.0s), 023/300 VUs, 486 complete and 0 interrupted iterations
stress   [   4% ] 023/300 VUs  0m14.0s/5m30.0s

running (0m15.0s), 024/300 VUs, 565 complete and 0 interrupted iterations
stress   [   5% ] 024/300 VUs  0m15.0s/5m30.0s

running (0m16.0s), 026/300 VUs, 651 complete and 0 interrupted iterations
stress   [   5% ] 026/300 VUs  0m16.0s/5m30.0s

running (0m17.0s), 028/300 VUs, 733 complete and 0 interrupted iterations
stress   [   5% ] 028/300 VUs  0m17.0s/5m30.0s

running (0m18.0s), 029/300 VUs, 820 complete and 0 interrupted iterations
stress   [   5% ] 029/300 VUs  0m18.0s/5m30.0s

running (0m19.0s), 031/300 VUs, 925 complete and 0 interrupted iterations
stress   [   6% ] 031/300 VUs  0m19.0s/5m30.0s

running (0m20.0s), 033/300 VUs, 1028 complete and 0 interrupted iterations
stress   [   6% ] 033/300 VUs  0m20.0s/5m30.0s

running (0m21.0s), 034/300 VUs, 1133 complete and 0 interrupted iterations
stress   [   6% ] 034/300 VUs  0m21.0s/5m30.0s

running (0m22.0s), 036/300 VUs, 1244 complete and 0 interrupted iterations
stress   [   7% ] 036/300 VUs  0m22.0s/5m30.0s

running (0m23.0s), 038/300 VUs, 1370 complete and 0 interrupted iterations
stress   [   7% ] 038/300 VUs  0m23.0s/5m30.0s

running (0m24.0s), 039/300 VUs, 1494 complete and 0 interrupted iterations
stress   [   7% ] 039/300 VUs  0m24.0s/5m30.0s

running (0m25.0s), 041/300 VUs, 1620 complete and 0 interrupted iterations
stress   [   8% ] 041/300 VUs  0m25.0s/5m30.0s

running (0m26.0s), 043/300 VUs, 1753 complete and 0 interrupted iterations
stress   [   8% ] 043/300 VUs  0m26.0s/5m30.0s

running (0m27.0s), 044/300 VUs, 1896 complete and 0 interrupted iterations
stress   [   8% ] 044/300 VUs  0m27.0s/5m30.0s

running (0m28.0s), 046/300 VUs, 2045 complete and 0 interrupted iterations
stress   [   8% ] 046/300 VUs  0m28.0s/5m30.0s

running (0m29.0s), 048/300 VUs, 2197 complete and 0 interrupted iterations
stress   [   9% ] 048/300 VUs  0m29.0s/5m30.0s

running (0m30.0s), 049/300 VUs, 2348 complete and 0 interrupted iterations
stress   [   9% ] 049/300 VUs  0m30.0s/5m30.0s

running (0m31.0s), 051/300 VUs, 2517 complete and 0 interrupted iterations
stress   [   9% ] 051/300 VUs  0m31.0s/5m30.0s

running (0m32.0s), 053/300 VUs, 2686 complete and 0 interrupted iterations
stress   [  10% ] 053/300 VUs  0m32.0s/5m30.0s

running (0m33.0s), 054/300 VUs, 2856 complete and 0 interrupted iterations
stress   [  10% ] 054/300 VUs  0m33.0s/5m30.0s

running (0m34.0s), 056/300 VUs, 3034 complete and 0 interrupted iterations
stress   [  10% ] 056/300 VUs  0m34.0s/5m30.0s

running (0m35.0s), 058/300 VUs, 3218 complete and 0 interrupted iterations
stress   [  11% ] 058/300 VUs  0m35.0s/5m30.0s

running (0m36.0s), 059/300 VUs, 3408 complete and 0 interrupted iterations
stress   [  11% ] 059/300 VUs  0m36.0s/5m30.0s

running (0m37.0s), 061/300 VUs, 3602 complete and 0 interrupted iterations
stress   [  11% ] 061/300 VUs  0m37.0s/5m30.0s

running (0m38.0s), 063/300 VUs, 3798 complete and 0 interrupted iterations
stress   [  12% ] 063/300 VUs  0m38.0s/5m30.0s

running (0m39.0s), 064/300 VUs, 4007 complete and 0 interrupted iterations
stress   [  12% ] 064/300 VUs  0m39.0s/5m30.0s

running (0m40.0s), 066/300 VUs, 4214 complete and 0 interrupted iterations
stress   [  12% ] 066/300 VUs  0m40.0s/5m30.0s

running (0m41.0s), 068/300 VUs, 4429 complete and 0 interrupted iterations
stress   [  12% ] 068/300 VUs  0m41.0s/5m30.0s

running (0m42.0s), 069/300 VUs, 4652 complete and 0 interrupted iterations
stress   [  13% ] 069/300 VUs  0m42.0s/5m30.0s

running (0m43.0s), 071/300 VUs, 4874 complete and 0 interrupted iterations
stress   [  13% ] 071/300 VUs  0m43.0s/5m30.0s

running (0m44.0s), 073/300 VUs, 5105 complete and 0 interrupted iterations
stress   [  13% ] 073/300 VUs  0m44.0s/5m30.0s

running (0m45.0s), 074/300 VUs, 5339 complete and 0 interrupted iterations
stress   [  14% ] 074/300 VUs  0m45.0s/5m30.0s

running (0m46.0s), 076/300 VUs, 5580 complete and 0 interrupted iterations
stress   [  14% ] 076/300 VUs  0m46.0s/5m30.0s

running (0m47.0s), 078/300 VUs, 5818 complete and 0 interrupted iterations
stress   [  14% ] 078/300 VUs  0m47.0s/5m30.0s

running (0m48.0s), 079/300 VUs, 6070 complete and 0 interrupted iterations
stress   [  15% ] 079/300 VUs  0m48.0s/5m30.0s

running (0m49.0s), 081/300 VUs, 6329 complete and 0 interrupted iterations
stress   [  15% ] 081/300 VUs  0m49.0s/5m30.0s

running (0m50.0s), 083/300 VUs, 6591 complete and 0 interrupted iterations
stress   [  15% ] 083/300 VUs  0m50.0s/5m30.0s

running (0m51.0s), 084/300 VUs, 6855 complete and 0 interrupted iterations
stress   [  15% ] 084/300 VUs  0m51.0s/5m30.0s

running (0m52.0s), 086/300 VUs, 7122 complete and 0 interrupted iterations
stress   [  16% ] 086/300 VUs  0m52.0s/5m30.0s

running (0m53.0s), 088/300 VUs, 7389 complete and 0 interrupted iterations
stress   [  16% ] 088/300 VUs  0m53.0s/5m30.0s

running (0m54.0s), 089/300 VUs, 7668 complete and 0 interrupted iterations
stress   [  16% ] 089/300 VUs  0m54.0s/5m30.0s

running (0m55.0s), 091/300 VUs, 7957 complete and 0 interrupted iterations
stress   [  17% ] 091/300 VUs  0m55.0s/5m30.0s

running (0m56.0s), 093/300 VUs, 8248 complete and 0 interrupted iterations
stress   [  17% ] 093/300 VUs  0m56.0s/5m30.0s

running (0m57.0s), 094/300 VUs, 8540 complete and 0 interrupted iterations
stress   [  17% ] 094/300 VUs  0m57.0s/5m30.0s

running (0m58.0s), 096/300 VUs, 8850 complete and 0 interrupted iterations
stress   [  18% ] 096/300 VUs  0m58.0s/5m30.0s

running (0m59.0s), 098/300 VUs, 9167 complete and 0 interrupted iterations
stress   [  18% ] 098/300 VUs  0m59.0s/5m30.0s

running (1m00.0s), 099/300 VUs, 9472 complete and 0 interrupted iterations
stress   [  18% ] 099/300 VUs  1m00.0s/5m30.0s

running (1m01.0s), 101/300 VUs, 9797 complete and 0 interrupted iterations
stress   [  18% ] 101/300 VUs  1m01.0s/5m30.0s

running (1m02.0s), 103/300 VUs, 10123 complete and 0 interrupted iterations
stress   [  19% ] 103/300 VUs  1m02.0s/5m30.0s

running (1m03.0s), 104/300 VUs, 10446 complete and 0 interrupted iterations
stress   [  19% ] 104/300 VUs  1m03.0s/5m30.0s

running (1m04.0s), 106/300 VUs, 10783 complete and 0 interrupted iterations
stress   [  19% ] 106/300 VUs  1m04.0s/5m30.0s

running (1m05.0s), 108/300 VUs, 11121 complete and 0 interrupted iterations
stress   [  20% ] 108/300 VUs  1m05.0s/5m30.0s

running (1m06.0s), 109/300 VUs, 11473 complete and 0 interrupted iterations
stress   [  20% ] 109/300 VUs  1m06.0s/5m30.0s

running (1m07.0s), 111/300 VUs, 11823 complete and 0 interrupted iterations
stress   [  20% ] 111/300 VUs  1m07.0s/5m30.0s

running (1m08.0s), 113/300 VUs, 12186 complete and 0 interrupted iterations
stress   [  21% ] 113/300 VUs  1m08.0s/5m30.0s

running (1m09.0s), 114/300 VUs, 12544 complete and 0 interrupted iterations
stress   [  21% ] 114/300 VUs  1m09.0s/5m30.0s

running (1m10.0s), 116/300 VUs, 12916 complete and 0 interrupted iterations
stress   [  21% ] 116/300 VUs  1m10.0s/5m30.0s

running (1m11.0s), 118/300 VUs, 13279 complete and 0 interrupted iterations
stress   [  22% ] 118/300 VUs  1m11.0s/5m30.0s

running (1m12.0s), 119/300 VUs, 13655 complete and 0 interrupted iterations
stress   [  22% ] 119/300 VUs  1m12.0s/5m30.0s

running (1m13.0s), 121/300 VUs, 14038 complete and 0 interrupted iterations
stress   [  22% ] 121/300 VUs  1m13.0s/5m30.0s

running (1m14.0s), 123/300 VUs, 14412 complete and 0 interrupted iterations
stress   [  22% ] 123/300 VUs  1m14.0s/5m30.0s

running (1m15.0s), 124/300 VUs, 14803 complete and 0 interrupted iterations
stress   [  23% ] 124/300 VUs  1m15.0s/5m30.0s

running (1m16.0s), 126/300 VUs, 15200 complete and 0 interrupted iterations
stress   [  23% ] 126/300 VUs  1m16.0s/5m30.0s

running (1m17.0s), 128/300 VUs, 15599 complete and 0 interrupted iterations
stress   [  23% ] 128/300 VUs  1m17.0s/5m30.0s

running (1m18.0s), 129/300 VUs, 16010 complete and 0 interrupted iterations
stress   [  24% ] 129/300 VUs  1m18.0s/5m30.0s

running (1m19.0s), 131/300 VUs, 16432 complete and 0 interrupted iterations
stress   [  24% ] 131/300 VUs  1m19.0s/5m30.0s

running (1m20.0s), 133/300 VUs, 16843 complete and 0 interrupted iterations
stress   [  24% ] 133/300 VUs  1m20.0s/5m30.0s

running (1m21.0s), 134/300 VUs, 17276 complete and 0 interrupted iterations
stress   [  25% ] 134/300 VUs  1m21.0s/5m30.0s

running (1m22.0s), 136/300 VUs, 17706 complete and 0 interrupted iterations
stress   [  25% ] 136/300 VUs  1m22.0s/5m30.0s

running (1m23.0s), 138/300 VUs, 18133 complete and 0 interrupted iterations
stress   [  25% ] 138/300 VUs  1m23.0s/5m30.0s

running (1m24.0s), 139/300 VUs, 18570 complete and 0 interrupted iterations
stress   [  25% ] 139/300 VUs  1m24.0s/5m30.0s

running (1m25.0s), 141/300 VUs, 19013 complete and 0 interrupted iterations
stress   [  26% ] 141/300 VUs  1m25.0s/5m30.0s

running (1m26.0s), 143/300 VUs, 19460 complete and 0 interrupted iterations
stress   [  26% ] 143/300 VUs  1m26.0s/5m30.0s

running (1m27.0s), 144/300 VUs, 19915 complete and 0 interrupted iterations
stress   [  26% ] 144/300 VUs  1m27.0s/5m30.0s

running (1m28.0s), 146/300 VUs, 20364 complete and 0 interrupted iterations
stress   [  27% ] 146/300 VUs  1m28.0s/5m30.0s

running (1m29.0s), 148/300 VUs, 20831 complete and 0 interrupted iterations
stress   [  27% ] 148/300 VUs  1m29.0s/5m30.0s

running (1m30.0s), 149/300 VUs, 21180 complete and 0 interrupted iterations
stress   [  27% ] 149/300 VUs  1m30.0s/5m30.0s

running (1m31.0s), 151/300 VUs, 21422 complete and 0 interrupted iterations
stress   [  28% ] 151/300 VUs  1m31.0s/5m30.0s

running (1m32.0s), 153/300 VUs, 21895 complete and 0 interrupted iterations
stress   [  28% ] 153/300 VUs  1m32.0s/5m30.0s

running (1m33.0s), 154/300 VUs, 22370 complete and 0 interrupted iterations
stress   [  28% ] 154/300 VUs  1m33.0s/5m30.0s

running (1m34.0s), 156/300 VUs, 22859 complete and 0 interrupted iterations
stress   [  28% ] 156/300 VUs  1m34.0s/5m30.0s

running (1m35.0s), 158/300 VUs, 23352 complete and 0 interrupted iterations
stress   [  29% ] 158/300 VUs  1m35.0s/5m30.0s

running (1m36.0s), 159/300 VUs, 23842 complete and 0 interrupted iterations
stress   [  29% ] 159/300 VUs  1m36.0s/5m30.0s

running (1m37.0s), 161/300 VUs, 24335 complete and 0 interrupted iterations
stress   [  29% ] 161/300 VUs  1m37.0s/5m30.0s

running (1m38.0s), 163/300 VUs, 24832 complete and 0 interrupted iterations
stress   [  30% ] 163/300 VUs  1m38.0s/5m30.0s

running (1m39.0s), 164/300 VUs, 25343 complete and 0 interrupted iterations
stress   [  30% ] 164/300 VUs  1m39.0s/5m30.0s

running (1m40.0s), 166/300 VUs, 25853 complete and 0 interrupted iterations
stress   [  30% ] 166/300 VUs  1m40.0s/5m30.0s

running (1m41.0s), 168/300 VUs, 26375 complete and 0 interrupted iterations
stress   [  31% ] 168/300 VUs  1m41.0s/5m30.0s

running (1m42.0s), 169/300 VUs, 26901 complete and 0 interrupted iterations
stress   [  31% ] 169/300 VUs  1m42.0s/5m30.0s

running (1m43.0s), 171/300 VUs, 27433 complete and 0 interrupted iterations
stress   [  31% ] 171/300 VUs  1m43.0s/5m30.0s

running (1m44.0s), 173/300 VUs, 27969 complete and 0 interrupted iterations
stress   [  32% ] 173/300 VUs  1m44.0s/5m30.0s

running (1m45.0s), 174/300 VUs, 28504 complete and 0 interrupted iterations
stress   [  32% ] 174/300 VUs  1m45.0s/5m30.0s

running (1m46.0s), 176/300 VUs, 29049 complete and 0 interrupted iterations
stress   [  32% ] 176/300 VUs  1m46.0s/5m30.0s

running (1m47.0s), 178/300 VUs, 29553 complete and 0 interrupted iterations
stress   [  32% ] 178/300 VUs  1m47.0s/5m30.0s

running (1m48.0s), 179/300 VUs, 30059 complete and 0 interrupted iterations
stress   [  33% ] 179/300 VUs  1m48.0s/5m30.0s

running (1m49.0s), 181/300 VUs, 30626 complete and 0 interrupted iterations
stress   [  33% ] 181/300 VUs  1m49.0s/5m30.0s

running (1m50.0s), 183/300 VUs, 31181 complete and 0 interrupted iterations
stress   [  33% ] 183/300 VUs  1m50.0s/5m30.0s

running (1m51.0s), 184/300 VUs, 31706 complete and 0 interrupted iterations
stress   [  34% ] 184/300 VUs  1m51.0s/5m30.0s

running (1m52.0s), 186/300 VUs, 32271 complete and 0 interrupted iterations
stress   [  34% ] 186/300 VUs  1m52.0s/5m30.0s

running (1m53.0s), 188/300 VUs, 32845 complete and 0 interrupted iterations
stress   [  34% ] 188/300 VUs  1m53.0s/5m30.0s

running (1m54.0s), 189/300 VUs, 33401 complete and 0 interrupted iterations
stress   [  35% ] 189/300 VUs  1m54.0s/5m30.0s

running (1m55.0s), 191/300 VUs, 33939 complete and 0 interrupted iterations
stress   [  35% ] 191/300 VUs  1m55.0s/5m30.0s

running (1m56.0s), 193/300 VUs, 34531 complete and 0 interrupted iterations
stress   [  35% ] 193/300 VUs  1m56.0s/5m30.0s

running (1m57.0s), 194/300 VUs, 35114 complete and 0 interrupted iterations
stress   [  35% ] 194/300 VUs  1m57.0s/5m30.0s

running (1m58.0s), 196/300 VUs, 35721 complete and 0 interrupted iterations
stress   [  36% ] 196/300 VUs  1m58.0s/5m30.0s

running (1m59.0s), 198/300 VUs, 36298 complete and 0 interrupted iterations
stress   [  36% ] 198/300 VUs  1m59.0s/5m30.0s

running (2m00.0s), 199/300 VUs, 36887 complete and 0 interrupted iterations
stress   [  36% ] 199/300 VUs  2m00.0s/5m30.0s

running (2m01.0s), 201/300 VUs, 37494 complete and 0 interrupted iterations
stress   [  37% ] 201/300 VUs  2m01.0s/5m30.0s

running (2m02.0s), 203/300 VUs, 38077 complete and 0 interrupted iterations
stress   [  37% ] 203/300 VUs  2m02.0s/5m30.0s

running (2m03.0s), 204/300 VUs, 38671 complete and 0 interrupted iterations
stress   [  37% ] 204/300 VUs  2m03.0s/5m30.0s

running (2m04.0s), 206/300 VUs, 39225 complete and 0 interrupted iterations
stress   [  38% ] 206/300 VUs  2m04.0s/5m30.0s

running (2m05.0s), 208/300 VUs, 39776 complete and 0 interrupted iterations
stress   [  38% ] 208/300 VUs  2m05.0s/5m30.0s

running (2m06.0s), 209/300 VUs, 40402 complete and 0 interrupted iterations
stress   [  38% ] 209/300 VUs  2m06.0s/5m30.0s

running (2m07.0s), 211/300 VUs, 41044 complete and 0 interrupted iterations
stress   [  38% ] 211/300 VUs  2m07.0s/5m30.0s

running (2m08.0s), 213/300 VUs, 41686 complete and 0 interrupted iterations
stress   [  39% ] 213/300 VUs  2m08.0s/5m30.0s

running (2m09.0s), 214/300 VUs, 42333 complete and 0 interrupted iterations
stress   [  39% ] 214/300 VUs  2m09.0s/5m30.0s

running (2m10.0s), 216/300 VUs, 42974 complete and 0 interrupted iterations
stress   [  39% ] 216/300 VUs  2m10.0s/5m30.0s

running (2m11.0s), 218/300 VUs, 43630 complete and 0 interrupted iterations
stress   [  40% ] 218/300 VUs  2m11.0s/5m30.0s

running (2m12.0s), 219/300 VUs, 44286 complete and 0 interrupted iterations
stress   [  40% ] 219/300 VUs  2m12.0s/5m30.0s

running (2m13.0s), 221/300 VUs, 44943 complete and 0 interrupted iterations
stress   [  40% ] 221/300 VUs  2m13.0s/5m30.0s

running (2m14.0s), 223/300 VUs, 45570 complete and 0 interrupted iterations
stress   [  41% ] 223/300 VUs  2m14.0s/5m30.0s

running (2m15.0s), 224/300 VUs, 46214 complete and 0 interrupted iterations
stress   [  41% ] 224/300 VUs  2m15.0s/5m30.0s

running (2m16.0s), 226/300 VUs, 46867 complete and 0 interrupted iterations
stress   [  41% ] 226/300 VUs  2m16.0s/5m30.0s

running (2m17.0s), 228/300 VUs, 47514 complete and 0 interrupted iterations
stress   [  42% ] 228/300 VUs  2m17.0s/5m30.0s

running (2m18.0s), 229/300 VUs, 48190 complete and 0 interrupted iterations
stress   [  42% ] 229/300 VUs  2m18.0s/5m30.0s

running (2m19.0s), 231/300 VUs, 48876 complete and 0 interrupted iterations
stress   [  42% ] 231/300 VUs  2m19.0s/5m30.0s

running (2m20.0s), 233/300 VUs, 49548 complete and 0 interrupted iterations
stress   [  42% ] 233/300 VUs  2m20.0s/5m30.0s

running (2m21.0s), 234/300 VUs, 50103 complete and 0 interrupted iterations
stress   [  43% ] 234/300 VUs  2m21.0s/5m30.0s

running (2m22.0s), 236/300 VUs, 50701 complete and 0 interrupted iterations
stress   [  43% ] 236/300 VUs  2m22.0s/5m30.0s

running (2m23.0s), 238/300 VUs, 51342 complete and 0 interrupted iterations
stress   [  43% ] 238/300 VUs  2m23.0s/5m30.0s

running (2m24.0s), 239/300 VUs, 51994 complete and 0 interrupted iterations
stress   [  44% ] 239/300 VUs  2m24.0s/5m30.0s

running (2m25.0s), 241/300 VUs, 52636 complete and 0 interrupted iterations
stress   [  44% ] 241/300 VUs  2m25.0s/5m30.0s

running (2m26.0s), 243/300 VUs, 53297 complete and 0 interrupted iterations
stress   [  44% ] 243/300 VUs  2m26.0s/5m30.0s

running (2m27.0s), 244/300 VUs, 53962 complete and 0 interrupted iterations
stress   [  45% ] 244/300 VUs  2m27.0s/5m30.0s

running (2m28.0s), 246/300 VUs, 54599 complete and 0 interrupted iterations
stress   [  45% ] 246/300 VUs  2m28.0s/5m30.0s

running (2m29.0s), 248/300 VUs, 55251 complete and 0 interrupted iterations
stress   [  45% ] 248/300 VUs  2m29.0s/5m30.0s

running (2m30.0s), 249/300 VUs, 55856 complete and 0 interrupted iterations
stress   [  45% ] 249/300 VUs  2m30.0s/5m30.0s

running (2m31.0s), 251/300 VUs, 56490 complete and 0 interrupted iterations
stress   [  46% ] 251/300 VUs  2m31.0s/5m30.0s

running (2m32.0s), 253/300 VUs, 57120 complete and 0 interrupted iterations
stress   [  46% ] 253/300 VUs  2m32.0s/5m30.0s

running (2m33.0s), 254/300 VUs, 57756 complete and 0 interrupted iterations
stress   [  46% ] 254/300 VUs  2m33.0s/5m30.0s

running (2m34.0s), 256/300 VUs, 58408 complete and 0 interrupted iterations
stress   [  47% ] 256/300 VUs  2m34.0s/5m30.0s

running (2m35.0s), 258/300 VUs, 59074 complete and 0 interrupted iterations
stress   [  47% ] 258/300 VUs  2m35.0s/5m30.0s

running (2m36.0s), 259/300 VUs, 59735 complete and 0 interrupted iterations
stress   [  47% ] 259/300 VUs  2m36.0s/5m30.0s

running (2m37.0s), 261/300 VUs, 60398 complete and 0 interrupted iterations
stress   [  48% ] 261/300 VUs  2m37.0s/5m30.0s

running (2m38.0s), 263/300 VUs, 60911 complete and 0 interrupted iterations
stress   [  48% ] 263/300 VUs  2m38.0s/5m30.0s

running (2m39.0s), 264/300 VUs, 61490 complete and 0 interrupted iterations
stress   [  48% ] 264/300 VUs  2m39.0s/5m30.0s

running (2m40.0s), 266/300 VUs, 62129 complete and 0 interrupted iterations
stress   [  48% ] 266/300 VUs  2m40.0s/5m30.0s

running (2m41.0s), 268/300 VUs, 62796 complete and 0 interrupted iterations
stress   [  49% ] 268/300 VUs  2m41.0s/5m30.0s

running (2m42.0s), 269/300 VUs, 63483 complete and 0 interrupted iterations
stress   [  49% ] 269/300 VUs  2m42.0s/5m30.0s

running (2m43.0s), 271/300 VUs, 64137 complete and 0 interrupted iterations
stress   [  49% ] 271/300 VUs  2m43.0s/5m30.0s

running (2m44.0s), 273/300 VUs, 64767 complete and 0 interrupted iterations
stress   [  50% ] 273/300 VUs  2m44.0s/5m30.0s

running (2m45.0s), 274/300 VUs, 65388 complete and 0 interrupted iterations
stress   [  50% ] 274/300 VUs  2m45.0s/5m30.0s

running (2m46.0s), 276/300 VUs, 66024 complete and 0 interrupted iterations
stress   [  50% ] 276/300 VUs  2m46.0s/5m30.0s

running (2m47.0s), 278/300 VUs, 66683 complete and 0 interrupted iterations
stress   [  51% ] 278/300 VUs  2m47.0s/5m30.0s

running (2m48.0s), 279/300 VUs, 67335 complete and 0 interrupted iterations
stress   [  51% ] 279/300 VUs  2m48.0s/5m30.0s

running (2m49.0s), 281/300 VUs, 67951 complete and 0 interrupted iterations
stress   [  51% ] 281/300 VUs  2m49.0s/5m30.0s

running (2m50.0s), 283/300 VUs, 68632 complete and 0 interrupted iterations
stress   [  52% ] 283/300 VUs  2m50.0s/5m30.0s

running (2m51.0s), 284/300 VUs, 69229 complete and 0 interrupted iterations
stress   [  52% ] 284/300 VUs  2m51.0s/5m30.0s

running (2m52.0s), 286/300 VUs, 69835 complete and 0 interrupted iterations
stress   [  52% ] 286/300 VUs  2m52.0s/5m30.0s

running (2m53.0s), 288/300 VUs, 70444 complete and 0 interrupted iterations
stress   [  52% ] 288/300 VUs  2m53.0s/5m30.0s

running (2m54.0s), 289/300 VUs, 71000 complete and 0 interrupted iterations
stress   [  53% ] 289/300 VUs  2m54.0s/5m30.0s

running (2m55.0s), 291/300 VUs, 71521 complete and 0 interrupted iterations
stress   [  53% ] 291/300 VUs  2m55.0s/5m30.0s

running (2m56.0s), 293/300 VUs, 72116 complete and 0 interrupted iterations
stress   [  53% ] 293/300 VUs  2m56.0s/5m30.0s

running (2m57.0s), 294/300 VUs, 72759 complete and 0 interrupted iterations
stress   [  54% ] 294/300 VUs  2m57.0s/5m30.0s

running (2m58.0s), 296/300 VUs, 73395 complete and 0 interrupted iterations
stress   [  54% ] 296/300 VUs  2m58.0s/5m30.0s

running (2m59.0s), 298/300 VUs, 74065 complete and 0 interrupted iterations
stress   [  54% ] 298/300 VUs  2m59.0s/5m30.0s

running (3m00.0s), 299/300 VUs, 74690 complete and 0 interrupted iterations
stress   [  55% ] 299/300 VUs  3m00.0s/5m30.0s

running (3m01.0s), 300/300 VUs, 75276 complete and 0 interrupted iterations
stress   [  55% ] 300/300 VUs  3m01.0s/5m30.0s

running (3m02.0s), 300/300 VUs, 75911 complete and 0 interrupted iterations
stress   [  55% ] 300/300 VUs  3m02.0s/5m30.0s

running (3m03.0s), 300/300 VUs, 76502 complete and 0 interrupted iterations
stress   [  55% ] 300/300 VUs  3m03.0s/5m30.0s

running (3m04.0s), 300/300 VUs, 77107 complete and 0 interrupted iterations
stress   [  56% ] 300/300 VUs  3m04.0s/5m30.0s

running (3m05.0s), 300/300 VUs, 77692 complete and 0 interrupted iterations
stress   [  56% ] 300/300 VUs  3m05.0s/5m30.0s

running (3m06.0s), 300/300 VUs, 78358 complete and 0 interrupted iterations
stress   [  56% ] 300/300 VUs  3m06.0s/5m30.0s

running (3m07.0s), 300/300 VUs, 79001 complete and 0 interrupted iterations
stress   [  57% ] 300/300 VUs  3m07.0s/5m30.0s

running (3m08.0s), 300/300 VUs, 79661 complete and 0 interrupted iterations
stress   [  57% ] 300/300 VUs  3m08.0s/5m30.0s

running (3m09.0s), 300/300 VUs, 80293 complete and 0 interrupted iterations
stress   [  57% ] 300/300 VUs  3m09.0s/5m30.0s

running (3m10.0s), 300/300 VUs, 80948 complete and 0 interrupted iterations
stress   [  58% ] 300/300 VUs  3m10.0s/5m30.0s

running (3m11.0s), 300/300 VUs, 81549 complete and 0 interrupted iterations
stress   [  58% ] 300/300 VUs  3m11.0s/5m30.0s

running (3m12.0s), 300/300 VUs, 82154 complete and 0 interrupted iterations
stress   [  58% ] 300/300 VUs  3m12.0s/5m30.0s

running (3m13.0s), 300/300 VUs, 82774 complete and 0 interrupted iterations
stress   [  58% ] 300/300 VUs  3m13.0s/5m30.0s

running (3m14.0s), 300/300 VUs, 83418 complete and 0 interrupted iterations
stress   [  59% ] 300/300 VUs  3m14.0s/5m30.0s

running (3m15.0s), 300/300 VUs, 84053 complete and 0 interrupted iterations
stress   [  59% ] 300/300 VUs  3m15.0s/5m30.0s

running (3m16.0s), 300/300 VUs, 84699 complete and 0 interrupted iterations
stress   [  59% ] 300/300 VUs  3m16.0s/5m30.0s

running (3m17.0s), 300/300 VUs, 85396 complete and 0 interrupted iterations
stress   [  60% ] 300/300 VUs  3m17.0s/5m30.0s

running (3m18.0s), 300/300 VUs, 86080 complete and 0 interrupted iterations
stress   [  60% ] 300/300 VUs  3m18.0s/5m30.0s

running (3m19.0s), 300/300 VUs, 86728 complete and 0 interrupted iterations
stress   [  60% ] 300/300 VUs  3m19.0s/5m30.0s

running (3m20.0s), 300/300 VUs, 87381 complete and 0 interrupted iterations
stress   [  61% ] 300/300 VUs  3m20.0s/5m30.0s

running (3m21.0s), 300/300 VUs, 88044 complete and 0 interrupted iterations
stress   [  61% ] 300/300 VUs  3m21.0s/5m30.0s

running (3m22.0s), 300/300 VUs, 88699 complete and 0 interrupted iterations
stress   [  61% ] 300/300 VUs  3m22.0s/5m30.0s

running (3m23.0s), 300/300 VUs, 89366 complete and 0 interrupted iterations
stress   [  62% ] 300/300 VUs  3m23.0s/5m30.0s

running (3m24.0s), 300/300 VUs, 90034 complete and 0 interrupted iterations
stress   [  62% ] 300/300 VUs  3m24.0s/5m30.0s

running (3m25.0s), 300/300 VUs, 90685 complete and 0 interrupted iterations
stress   [  62% ] 300/300 VUs  3m25.0s/5m30.0s

running (3m26.0s), 300/300 VUs, 91367 complete and 0 interrupted iterations
stress   [  62% ] 300/300 VUs  3m26.0s/5m30.0s

running (3m27.0s), 300/300 VUs, 91984 complete and 0 interrupted iterations
stress   [  63% ] 300/300 VUs  3m27.0s/5m30.0s

running (3m28.0s), 300/300 VUs, 92574 complete and 0 interrupted iterations
stress   [  63% ] 300/300 VUs  3m28.0s/5m30.0s

running (3m29.0s), 300/300 VUs, 93237 complete and 0 interrupted iterations
stress   [  63% ] 300/300 VUs  3m29.0s/5m30.0s

running (3m30.0s), 300/300 VUs, 93926 complete and 0 interrupted iterations
stress   [  64% ] 300/300 VUs  3m30.0s/5m30.0s

running (3m31.0s), 300/300 VUs, 94579 complete and 0 interrupted iterations
stress   [  64% ] 300/300 VUs  3m31.0s/5m30.0s

running (3m32.0s), 300/300 VUs, 95199 complete and 0 interrupted iterations
stress   [  64% ] 300/300 VUs  3m32.0s/5m30.0s

running (3m33.0s), 300/300 VUs, 95853 complete and 0 interrupted iterations
stress   [  65% ] 300/300 VUs  3m33.0s/5m30.0s

running (3m34.0s), 300/300 VUs, 96505 complete and 0 interrupted iterations
stress   [  65% ] 300/300 VUs  3m34.0s/5m30.0s

running (3m35.0s), 300/300 VUs, 97121 complete and 0 interrupted iterations
stress   [  65% ] 300/300 VUs  3m35.0s/5m30.0s

running (3m36.0s), 300/300 VUs, 97771 complete and 0 interrupted iterations
stress   [  65% ] 300/300 VUs  3m36.0s/5m30.0s

running (3m37.0s), 300/300 VUs, 98435 complete and 0 interrupted iterations
stress   [  66% ] 300/300 VUs  3m37.0s/5m30.0s

running (3m38.0s), 300/300 VUs, 99110 complete and 0 interrupted iterations
stress   [  66% ] 300/300 VUs  3m38.0s/5m30.0s

running (3m39.0s), 300/300 VUs, 99669 complete and 0 interrupted iterations
stress   [  66% ] 300/300 VUs  3m39.0s/5m30.0s

running (3m40.0s), 300/300 VUs, 100284 complete and 0 interrupted iterations
stress   [  67% ] 300/300 VUs  3m40.0s/5m30.0s

running (3m41.0s), 300/300 VUs, 100922 complete and 0 interrupted iterations
stress   [  67% ] 300/300 VUs  3m41.0s/5m30.0s

running (3m42.0s), 300/300 VUs, 101562 complete and 0 interrupted iterations
stress   [  67% ] 300/300 VUs  3m42.0s/5m30.0s

running (3m43.0s), 300/300 VUs, 102225 complete and 0 interrupted iterations
stress   [  68% ] 300/300 VUs  3m43.0s/5m30.0s

running (3m44.0s), 300/300 VUs, 102816 complete and 0 interrupted iterations
stress   [  68% ] 300/300 VUs  3m44.0s/5m30.0s

running (3m45.0s), 300/300 VUs, 103327 complete and 0 interrupted iterations
stress   [  68% ] 300/300 VUs  3m45.0s/5m30.0s

running (3m46.0s), 300/300 VUs, 103923 complete and 0 interrupted iterations
stress   [  68% ] 300/300 VUs  3m46.0s/5m30.0s

running (3m47.0s), 300/300 VUs, 104596 complete and 0 interrupted iterations
stress   [  69% ] 300/300 VUs  3m47.0s/5m30.0s

running (3m48.0s), 300/300 VUs, 105244 complete and 0 interrupted iterations
stress   [  69% ] 300/300 VUs  3m48.0s/5m30.0s

running (3m49.0s), 300/300 VUs, 105869 complete and 0 interrupted iterations
stress   [  69% ] 300/300 VUs  3m49.0s/5m30.0s

running (3m50.0s), 300/300 VUs, 106457 complete and 0 interrupted iterations
stress   [  70% ] 300/300 VUs  3m50.0s/5m30.0s

running (3m51.0s), 300/300 VUs, 107060 complete and 0 interrupted iterations
stress   [  70% ] 300/300 VUs  3m51.0s/5m30.0s

running (3m52.0s), 300/300 VUs, 107649 complete and 0 interrupted iterations
stress   [  70% ] 300/300 VUs  3m52.0s/5m30.0s

running (3m53.0s), 300/300 VUs, 108192 complete and 0 interrupted iterations
stress   [  71% ] 300/300 VUs  3m53.0s/5m30.0s

running (3m54.0s), 300/300 VUs, 108744 complete and 0 interrupted iterations
stress   [  71% ] 300/300 VUs  3m54.0s/5m30.0s

running (3m55.0s), 300/300 VUs, 109337 complete and 0 interrupted iterations
stress   [  71% ] 300/300 VUs  3m55.0s/5m30.0s

running (3m56.0s), 300/300 VUs, 109924 complete and 0 interrupted iterations
stress   [  72% ] 300/300 VUs  3m56.0s/5m30.0s

running (3m57.0s), 300/300 VUs, 110518 complete and 0 interrupted iterations
stress   [  72% ] 300/300 VUs  3m57.0s/5m30.0s

running (3m58.0s), 300/300 VUs, 111151 complete and 0 interrupted iterations
stress   [  72% ] 300/300 VUs  3m58.0s/5m30.0s

running (3m59.0s), 300/300 VUs, 111804 complete and 0 interrupted iterations
stress   [  72% ] 300/300 VUs  3m59.0s/5m30.0s

running (4m00.0s), 300/300 VUs, 112458 complete and 0 interrupted iterations
stress   [  73% ] 300/300 VUs  4m00.0s/5m30.0s

running (4m01.0s), 300/300 VUs, 113032 complete and 0 interrupted iterations
stress   [  73% ] 300/300 VUs  4m01.0s/5m30.0s

running (4m02.0s), 300/300 VUs, 113501 complete and 0 interrupted iterations
stress   [  73% ] 300/300 VUs  4m02.0s/5m30.0s

running (4m03.0s), 300/300 VUs, 114045 complete and 0 interrupted iterations
stress   [  74% ] 300/300 VUs  4m03.0s/5m30.0s

running (4m04.0s), 300/300 VUs, 114687 complete and 0 interrupted iterations
stress   [  74% ] 300/300 VUs  4m04.0s/5m30.0s

running (4m05.0s), 300/300 VUs, 115307 complete and 0 interrupted iterations
stress   [  74% ] 300/300 VUs  4m05.0s/5m30.0s

running (4m06.0s), 300/300 VUs, 115931 complete and 0 interrupted iterations
stress   [  75% ] 300/300 VUs  4m06.0s/5m30.0s

running (4m07.0s), 300/300 VUs, 116574 complete and 0 interrupted iterations
stress   [  75% ] 300/300 VUs  4m07.0s/5m30.0s

running (4m08.0s), 300/300 VUs, 117208 complete and 0 interrupted iterations
stress   [  75% ] 300/300 VUs  4m08.0s/5m30.0s

running (4m09.0s), 300/300 VUs, 117814 complete and 0 interrupted iterations
stress   [  75% ] 300/300 VUs  4m09.0s/5m30.0s

running (4m10.0s), 300/300 VUs, 118449 complete and 0 interrupted iterations
stress   [  76% ] 300/300 VUs  4m10.0s/5m30.0s

running (4m11.0s), 300/300 VUs, 119105 complete and 0 interrupted iterations
stress   [  76% ] 300/300 VUs  4m11.0s/5m30.0s

running (4m12.0s), 300/300 VUs, 119764 complete and 0 interrupted iterations
stress   [  76% ] 300/300 VUs  4m12.0s/5m30.0s

running (4m13.0s), 300/300 VUs, 120409 complete and 0 interrupted iterations
stress   [  77% ] 300/300 VUs  4m13.0s/5m30.0s

running (4m14.0s), 300/300 VUs, 121069 complete and 0 interrupted iterations
stress   [  77% ] 300/300 VUs  4m14.0s/5m30.0s

running (4m15.0s), 300/300 VUs, 121674 complete and 0 interrupted iterations
stress   [  77% ] 300/300 VUs  4m15.0s/5m30.0s

running (4m16.0s), 300/300 VUs, 122324 complete and 0 interrupted iterations
stress   [  78% ] 300/300 VUs  4m16.0s/5m30.0s

running (4m17.0s), 300/300 VUs, 123004 complete and 0 interrupted iterations
stress   [  78% ] 300/300 VUs  4m17.0s/5m30.0s

running (4m18.0s), 300/300 VUs, 123664 complete and 0 interrupted iterations
stress   [  78% ] 300/300 VUs  4m18.0s/5m30.0s

running (4m19.0s), 300/300 VUs, 124255 complete and 0 interrupted iterations
stress   [  78% ] 300/300 VUs  4m19.0s/5m30.0s

running (4m20.0s), 300/300 VUs, 124877 complete and 0 interrupted iterations
stress   [  79% ] 300/300 VUs  4m20.0s/5m30.0s

running (4m21.0s), 300/300 VUs, 125509 complete and 0 interrupted iterations
stress   [  79% ] 300/300 VUs  4m21.0s/5m30.0s

running (4m22.0s), 300/300 VUs, 126176 complete and 0 interrupted iterations
stress   [  79% ] 300/300 VUs  4m22.0s/5m30.0s

running (4m23.0s), 300/300 VUs, 126778 complete and 0 interrupted iterations
stress   [  80% ] 300/300 VUs  4m23.0s/5m30.0s

running (4m24.0s), 300/300 VUs, 127376 complete and 0 interrupted iterations
stress   [  80% ] 300/300 VUs  4m24.0s/5m30.0s

running (4m25.0s), 300/300 VUs, 128051 complete and 0 interrupted iterations
stress   [  80% ] 300/300 VUs  4m25.0s/5m30.0s

running (4m26.0s), 300/300 VUs, 128715 complete and 0 interrupted iterations
stress   [  81% ] 300/300 VUs  4m26.0s/5m30.0s

running (4m27.0s), 300/300 VUs, 129367 complete and 0 interrupted iterations
stress   [  81% ] 300/300 VUs  4m27.0s/5m30.0s

running (4m28.0s), 300/300 VUs, 130061 complete and 0 interrupted iterations
stress   [  81% ] 300/300 VUs  4m28.0s/5m30.0s

running (4m29.0s), 300/300 VUs, 130682 complete and 0 interrupted iterations
stress   [  82% ] 300/300 VUs  4m29.0s/5m30.0s

running (4m30.0s), 300/300 VUs, 131312 complete and 0 interrupted iterations
stress   [  82% ] 300/300 VUs  4m30.0s/5m30.0s

running (4m31.0s), 300/300 VUs, 131952 complete and 0 interrupted iterations
stress   [  82% ] 300/300 VUs  4m31.0s/5m30.0s

running (4m32.0s), 300/300 VUs, 132599 complete and 0 interrupted iterations
stress   [  82% ] 300/300 VUs  4m32.0s/5m30.0s

running (4m33.0s), 300/300 VUs, 133274 complete and 0 interrupted iterations
stress   [  83% ] 300/300 VUs  4m33.0s/5m30.0s

running (4m34.0s), 300/300 VUs, 133937 complete and 0 interrupted iterations
stress   [  83% ] 300/300 VUs  4m34.0s/5m30.0s

running (4m35.0s), 300/300 VUs, 134505 complete and 0 interrupted iterations
stress   [  83% ] 300/300 VUs  4m35.0s/5m30.0s

running (4m36.0s), 300/300 VUs, 134961 complete and 0 interrupted iterations
stress   [  84% ] 300/300 VUs  4m36.0s/5m30.0s

running (4m37.0s), 300/300 VUs, 135515 complete and 0 interrupted iterations
stress   [  84% ] 300/300 VUs  4m37.0s/5m30.0s

running (4m38.0s), 300/300 VUs, 136160 complete and 0 interrupted iterations
stress   [  84% ] 300/300 VUs  4m38.0s/5m30.0s

running (4m39.0s), 300/300 VUs, 136772 complete and 0 interrupted iterations
stress   [  85% ] 300/300 VUs  4m39.0s/5m30.0s

running (4m40.0s), 300/300 VUs, 137394 complete and 0 interrupted iterations
stress   [  85% ] 300/300 VUs  4m40.0s/5m30.0s

running (4m41.0s), 300/300 VUs, 138020 complete and 0 interrupted iterations
stress   [  85% ] 300/300 VUs  4m41.0s/5m30.0s

running (4m42.0s), 300/300 VUs, 138621 complete and 0 interrupted iterations
stress   [  85% ] 300/300 VUs  4m42.0s/5m30.0s

running (4m43.0s), 300/300 VUs, 139181 complete and 0 interrupted iterations
stress   [  86% ] 300/300 VUs  4m43.0s/5m30.0s

running (4m44.0s), 300/300 VUs, 139728 complete and 0 interrupted iterations
stress   [  86% ] 300/300 VUs  4m44.0s/5m30.0s

running (4m45.0s), 300/300 VUs, 140301 complete and 0 interrupted iterations
stress   [  86% ] 300/300 VUs  4m45.0s/5m30.0s

running (4m46.0s), 300/300 VUs, 140905 complete and 0 interrupted iterations
stress   [  87% ] 300/300 VUs  4m46.0s/5m30.0s

running (4m47.0s), 300/300 VUs, 141514 complete and 0 interrupted iterations
stress   [  87% ] 300/300 VUs  4m47.0s/5m30.0s

running (4m48.0s), 300/300 VUs, 142159 complete and 0 interrupted iterations
stress   [  87% ] 300/300 VUs  4m48.0s/5m30.0s

running (4m49.0s), 300/300 VUs, 142790 complete and 0 interrupted iterations
stress   [  88% ] 300/300 VUs  4m49.0s/5m30.0s

running (4m50.0s), 300/300 VUs, 143473 complete and 0 interrupted iterations
stress   [  88% ] 300/300 VUs  4m50.0s/5m30.0s

running (4m51.0s), 300/300 VUs, 144006 complete and 0 interrupted iterations
stress   [  88% ] 300/300 VUs  4m51.0s/5m30.0s

running (4m52.0s), 300/300 VUs, 144582 complete and 0 interrupted iterations
stress   [  88% ] 300/300 VUs  4m52.0s/5m30.0s

running (4m53.0s), 300/300 VUs, 145064 complete and 0 interrupted iterations
stress   [  89% ] 300/300 VUs  4m53.0s/5m30.0s

running (4m54.0s), 300/300 VUs, 145529 complete and 0 interrupted iterations
stress   [  89% ] 300/300 VUs  4m54.0s/5m30.0s

running (4m55.0s), 300/300 VUs, 146069 complete and 0 interrupted iterations
stress   [  89% ] 300/300 VUs  4m55.0s/5m30.0s

running (4m56.0s), 300/300 VUs, 146672 complete and 0 interrupted iterations
stress   [  90% ] 300/300 VUs  4m56.0s/5m30.0s

running (4m57.0s), 300/300 VUs, 147256 complete and 0 interrupted iterations
stress   [  90% ] 300/300 VUs  4m57.0s/5m30.0s

running (4m58.0s), 300/300 VUs, 147872 complete and 0 interrupted iterations
stress   [  90% ] 300/300 VUs  4m58.0s/5m30.0s

running (4m59.0s), 300/300 VUs, 148493 complete and 0 interrupted iterations
stress   [  91% ] 300/300 VUs  4m59.0s/5m30.0s

running (5m00.0s), 300/300 VUs, 149136 complete and 0 interrupted iterations
stress   [  91% ] 300/300 VUs  5m00.0s/5m30.0s

running (5m01.0s), 295/300 VUs, 149742 complete and 0 interrupted iterations
stress   [  91% ] 295/300 VUs  5m01.0s/5m30.0s

running (5m02.0s), 285/300 VUs, 150341 complete and 0 interrupted iterations
stress   [  92% ] 285/300 VUs  5m02.0s/5m30.0s

running (5m03.0s), 273/300 VUs, 150969 complete and 0 interrupted iterations
stress   [  92% ] 273/300 VUs  5m03.0s/5m30.0s

running (5m04.0s), 262/300 VUs, 151607 complete and 0 interrupted iterations
stress   [  92% ] 262/300 VUs  5m04.0s/5m30.0s

running (5m05.0s), 254/300 VUs, 152232 complete and 0 interrupted iterations
stress   [  92% ] 254/300 VUs  5m05.0s/5m30.0s

running (5m06.0s), 244/300 VUs, 152896 complete and 0 interrupted iterations
stress   [  93% ] 244/300 VUs  5m06.0s/5m30.0s

running (5m07.0s), 232/300 VUs, 153522 complete and 0 interrupted iterations
stress   [  93% ] 232/300 VUs  5m07.0s/5m30.0s

running (5m08.0s), 223/300 VUs, 154139 complete and 0 interrupted iterations
stress   [  93% ] 223/300 VUs  5m08.0s/5m30.0s

running (5m09.0s), 213/300 VUs, 154731 complete and 0 interrupted iterations
stress   [  94% ] 213/300 VUs  5m09.0s/5m30.0s

running (5m10.0s), 203/300 VUs, 155227 complete and 0 interrupted iterations
stress   [  94% ] 203/300 VUs  5m10.0s/5m30.0s

running (5m11.0s), 193/300 VUs, 155725 complete and 0 interrupted iterations
stress   [  94% ] 193/300 VUs  5m11.0s/5m30.0s

running (5m12.0s), 182/300 VUs, 156267 complete and 0 interrupted iterations
stress   [  95% ] 182/300 VUs  5m12.0s/5m30.0s

running (5m13.0s), 172/300 VUs, 156821 complete and 0 interrupted iterations
stress   [  95% ] 172/300 VUs  5m13.0s/5m30.0s

running (5m14.0s), 162/300 VUs, 157334 complete and 0 interrupted iterations
stress   [  95% ] 162/300 VUs  5m14.0s/5m30.0s

running (5m15.0s), 152/300 VUs, 157825 complete and 0 interrupted iterations
stress   [  95% ] 152/300 VUs  5m15.0s/5m30.0s

running (5m16.0s), 143/300 VUs, 158280 complete and 0 interrupted iterations
stress   [  96% ] 143/300 VUs  5m16.0s/5m30.0s

running (5m17.0s), 132/300 VUs, 158722 complete and 0 interrupted iterations
stress   [  96% ] 132/300 VUs  5m17.0s/5m30.0s

running (5m18.0s), 123/300 VUs, 159069 complete and 0 interrupted iterations
stress   [  96% ] 123/300 VUs  5m18.0s/5m30.0s

running (5m19.0s), 111/300 VUs, 159415 complete and 0 interrupted iterations
stress   [  97% ] 111/300 VUs  5m19.0s/5m30.0s

running (5m20.0s), 103/300 VUs, 159753 complete and 0 interrupted iterations
stress   [  97% ] 103/300 VUs  5m20.0s/5m30.0s

running (5m21.0s), 092/300 VUs, 160068 complete and 0 interrupted iterations
stress   [  97% ] 092/300 VUs  5m21.0s/5m30.0s

running (5m22.0s), 083/300 VUs, 160351 complete and 0 interrupted iterations
stress   [  98% ] 083/300 VUs  5m22.0s/5m30.0s

running (5m23.0s), 073/300 VUs, 160584 complete and 0 interrupted iterations
stress   [  98% ] 073/300 VUs  5m23.0s/5m30.0s

running (5m24.0s), 062/300 VUs, 160807 complete and 0 interrupted iterations
stress   [  98% ] 062/300 VUs  5m24.0s/5m30.0s

running (5m25.0s), 053/300 VUs, 160992 complete and 0 interrupted iterations
stress   [  98% ] 053/300 VUs  5m25.0s/5m30.0s

running (5m26.0s), 042/300 VUs, 161151 complete and 0 interrupted iterations
stress   [  99% ] 042/300 VUs  5m26.0s/5m30.0s

running (5m27.0s), 032/300 VUs, 161275 complete and 0 interrupted iterations
stress   [  99% ] 032/300 VUs  5m27.0s/5m30.0s

running (5m28.0s), 021/300 VUs, 161370 complete and 0 interrupted iterations
stress   [  99% ] 021/300 VUs  5m28.0s/5m30.0s

running (5m29.0s), 012/300 VUs, 161427 complete and 0 interrupted iterations
stress   [ 100% ] 012/300 VUs  5m29.0s/5m30.0s

running (5m30.0s), 003/300 VUs, 161455 complete and 0 interrupted iterations
stress   [ 100% ] 003/300 VUs  5m30.0s/5m30.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(99)<5000' p(99)=821.32ms

    http_req_failed
    ✓ 'rate<0.1' rate=0.00%

    order_create_errors
    ✓ 'rate<0.1' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 161458  488.963539/s
    checks_succeeded...: 100.00% 161458 out of 161458
    checks_failed......: 0.00%   0 out of 161458

    ✓ browse 200
    ✓ order create 201 or 5xx acceptable

    CUSTOM
    order_create_duration..........: avg=369.29ms min=10.28ms  med=439.67ms max=1.95s p(90)=670.2ms  p(95)=763.26ms
    order_create_errors............: 0.00%  0 out of 48474

    HTTP
    http_req_duration..............: avg=117.53ms min=2.16ms   med=9.13ms   max=1.95s p(90)=526.25ms p(95)=601.78ms
      { expected_response:true }...: avg=117.53ms min=2.16ms   med=9.13ms   max=1.95s p(90)=526.25ms p(95)=601.78ms
    http_req_failed................: 0.00%  0 out of 161458
    http_reqs......................: 161458 488.963539/s

    EXECUTION
    iteration_duration.............: avg=417.94ms min=302.34ms med=309.53ms max=2.25s p(90)=826.71ms p(95)=902.25ms
    iterations.....................: 161458 488.963539/s
    vus............................: 3      min=1           max=300
    vus_max........................: 300    min=300         max=300

    NETWORK
    data_received..................: 476 MB 1.4 MB/s
    data_sent......................: 31 MB  93 kB/s



running (5m30.2s), 000/300 VUs, 161458 complete and 0 interrupted iterations
stress ✓ [ 100% ] 000/300 VUs  5m30s